Test/test.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="https://www.neosurf.info/soap/">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:bill_payment soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <amount xsi:type="xsd:int">?</amount>
         <currency xsi:type="xsd:string">?</currency>
         <hash xsi:type="xsd:string">?</hash>
         <IDReseller xsi:type="xsd:string">?</IDReseller>
         <IDTransaction xsi:type="xsd:string">?</IDTransaction>
         <IDUser xsi:type="xsd:int">?</IDUser>
         <operator xsi:type="xsd:string">?</operator>
      </soap:bill_payment>
   </soapenv:Body>
</soapenv:Envelope>
